Revit 2024 API
BalusterPattern Class
 Baluster pattern class.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public class BalusterPattern : IDisposable
Visual Basic
Public Class BalusterPattern _
	Implements IDisposable
Visual C++
public ref class BalusterPattern : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.BalusterPattern
See Also
BalusterPattern Members
Autodesk.Revit.DB.Architecture Namespace